/*-----------------------------------------------*/
/*-	at coder - 281:C                            -*/
/*-----------------------------------------------*/

/* ヘッダ読み込み */
#include <stdio.h>
#include <stdlib.h> /*絶対値計算*/

/* メイン関数 */
int main (void) {
    /*定義*/
    int i;
    //long;
    //static long;
    char S[500001], T[500001];
    //printf("変数設定ここまで\n");

    /* 入力 */
    scanf("%s", S);
    scanf("%s", T);

    /*初期化*/

    /* 処理 */
    for(i=0; i<=500001; i++){
        if(S[i]!=T[i]){
            printf("%d", i+1);
            break;
        }
    }

    /* 出力 */


    /* 終了 */
    return 0;
}